Напишите класс Complex (комплексное число).
Конструктор класса должен получать на вход либо одно, либо два числа типа double (действительную или/и мнимую часть).
Переопределите бинарные операторы сложения, вычитания, умножения и деления (работающие в том числе и с действительными аргументами), унарные плюс и минус. Предусмотрите функции-члены Re и Im для получения действительной и мнимой части.
Определите внешнюю функцию Abs, возвращающую модуль комплексного числа. Не забудьте определить операции == и !=.